lab7_php_ci/ci4/app/Cells/ArtikelTerkini.php

    public function tampil($kategori = null)
    {
        $model = new ArtikelModel();

        if ($kategori) {
            $artikel = $model
                ->where('kategori', $kategori)
                ->orderBy('id', 'DESC')
                ->limit(5)
                ->findAll();
        } else {
            $artikel = $model
                ->orderBy('id', 'DESC')
                ->limit(5)
                ->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5